Repository: Ricninja89/digitalezen-antispam-shield-for-cf7
Catalog: languages/digitalezen-cf7-*.po
Languages: it

source: Advanced protection against spam for Contact Form 7. Blacklist, logging, flood control and a sleek dashboard.
it: Protezione avanzata contro lo spam per Contact Form 7. Blacklist, logging, controllo flood e dashboard elegante.

source: ⛔ Access temporarily blocked due to suspicious behavior.
it: ⛔ Accesso temporaneamente bloccato per comportamento sospetto.

source: ⏳ Session expired. Refresh the page and try again.
it: ⏳ Sessione scaduta. Ricarica la pagina e riprova.

source: Please do not submit so quickly.
it: Per favore non inviare così velocemente.

source: Weekly CF7 report - Blocked spam
it: Report settimanale CF7 - Spam bloccati

source: Attached is the file with attempts blocked by the anti-spam filter.
it: In allegato il file con i tentativi bloccati dal filtro antispam.

source: ⛔ Unauthorized access.
it: ⛔ Accesso non autorizzato.

source: ❌ File not found.
it: ❌ File non trovato.

source: Smart protection for Contact Form 7
it: Protezione intelligente per Contact Form 7

source: Every Monday at 2:00 AM the report of blocked spam attempts will be sent.
it: Ogni lunedì alle 2:00 il report dei tentativi spam bloccati verrà inviato.

source: Destination email
it: Email di destinazione

source: (Requires the Honeypot for Contact Form 7 plugin)
it: (Richiede il plugin Honeypot for Contact Form 7)

source: Log of blocked attempts (date, email, IP, reason, trigger)
it: Log dei tentativi bloccati (data, email, IP, motivo, trigger)

source: Blacklist updated from Apps Script (IP, email, domains, etc.)
it: Blacklist aggiornata da Apps Script (IP, email, domini, ecc.)

source: Temporarily blocked IPs (soft block, 10 minutes)
it: IP temporaneamente bloccati (soft block, 10 minuti)

source: Spam attempt history by IP
it: Storico tentativi spam per IP

source: Spam attempt history by email
it: Storico tentativi spam per email

source: Powered by <a href="https://digitalezen.it" target="_blank" style="text-decoration: none;">DigitaleZen.it</a> 🚀
it: Realizzato da <a href="https://digitalezen.it" target="_blank" style="text-decoration: none;">DigitaleZen.it</a> 🚀
